name: "AFnet_NIR"

layer {
    name: "data"
    type: "Data"
    top: "data"
    top: "label"
    include {
        phase: TRAIN
    }
    transform_param {
        mirror: true                                    #2 镜像
        mean_value: 128                                #5 均值，不能与#4同时用
        scale: 0.0078125
        force_gray: true                              #7 强制为灰度图

        # Begin Added by garylau for Image augmentation
        apply_probability: 0.5  #8 是否做smooth、brightness、color_shift是概率性事件
        smooth_filtering: true  #9 是否模糊处理                                             （随机）
        max_smooth: 6           #10 模糊处理参数                                            （随机）
        max_rotation_angle: 30  #11 旋转角度，（也用作仿射变换的旋转角度）                    （随机）
        contrast_brightness_adjustment: true #12 是否调节contrast、brightness                            （随机）
        min_contrast: 0.7         #13 调节contrast、brightness用                              （随机）
        max_contrast: 1.5         #14 调节contrast、brightness用                              （随机）
        max_brightness_shift: 20  #15 调节contrast、brightness用                                             （随机）
        min_side_min: 190         #17 对图像做缩放并随机裁剪时用，与#18同时用，不能与#19同时用   （随机）
        min_side_max: 250         #18 对图像做缩放并随机裁剪时用，与#17同时用，不能与#19同时用   （随机）
        affine_min_scale: 0.8     #20 仿射变换缩放尺度最小值                                  （随机）
        affine_max_scale: 1.2     #21 仿射变换缩放尺度最大值                                  （随机）
        random_erasing_low: 0.02  #22 随机擦除概率最小值                                      （随机）
        random_erasing_high: 0.2  #23 随机擦除概率最大值                                      （随机）
        random_erasing_ratio: 0.3 #24 用来确定随机擦除面积的比例的参数                         （随机）
        debug_params: false       #22 调试看数据增加是否正确时用
        # End Added by garylau for Image augmentation
    }
    data_param {
        source: "/data/train_data_cyy/train_face2d/train_face2d_train/face2d_v1.9/nir_train_lmdb/"
        batch_size: 256 
        backend: LMDB
    }
}
layer {
    name: "data"
    type: "Data"
    top: "data"
    top: "label"
    include {
        phase: TEST
    }
    transform_param {
        mirror: false
        mean_value: 128
        scale: 0.0078125
        force_gray: true
    }
    data_param {
        source: "/data/train_data_cyy/train_face2d/train_face2d_train/face2d_v1.9/nir_val_lmdb/"
        batch_size: 16
        backend: LMDB
    }
}

layer {
  name: "conv1"
  type: "BinaryConvolution"
  bottom: "data"
  top: "conv_blob1"
  convolution_param {
    num_output: 8
    bias_term: false
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm1"
  type: "BatchNorm"
  bottom: "conv_blob1"
  top: "conv_blob1"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale1"
  type: "Scale"
  bottom: "conv_blob1"
  top: "conv_blob1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv_blob1"
  top: "relu_blob1"
}
layer {
  name: "max_pool1"
  type: "Pooling"
  bottom: "relu_blob1"
  top: "max_pool_blob1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "BinaryConvolution"
  bottom: "max_pool_blob1"
  top: "conv_blob2"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm2"
  type: "BatchNorm"
  bottom: "conv_blob2"
  top: "conv_blob2"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale2"
  type: "Scale"
  bottom: "conv_blob2"
  top: "conv_blob2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv_blob2"
  top: "relu_blob2"
}
layer {
  name: "conv3"
  type: "BinaryConvolution"
  bottom: "relu_blob2"
  top: "conv_blob3"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm3"
  type: "BatchNorm"
  bottom: "conv_blob3"
  top: "conv_blob3"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale3"
  type: "Scale"
  bottom: "conv_blob3"
  top: "conv_blob3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv4"
  type: "BinaryConvolution"
  bottom: "max_pool_blob1"
  top: "conv_blob4"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm4"
  type: "BatchNorm"
  bottom: "conv_blob4"
  top: "conv_blob4"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale4"
  type: "Scale"
  bottom: "conv_blob4"
  top: "conv_blob4"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "add1"
  type: "Eltwise"
  bottom: "conv_blob3"
  bottom: "conv_blob4"
  top: "add_blob1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "add_blob1"
  top: "relu_blob3"
}
layer {
  name: "conv5"
  type: "BinaryConvolution"
  bottom: "relu_blob3"
  top: "conv_blob5"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm5"
  type: "BatchNorm"
  bottom: "conv_blob5"
  top: "conv_blob5"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale5"
  type: "Scale"
  bottom: "conv_blob5"
  top: "conv_blob5"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv_blob5"
  top: "relu_blob4"
}
layer {
  name: "conv6"
  type: "BinaryConvolution"
  bottom: "relu_blob4"
  top: "conv_blob6"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm6"
  type: "BatchNorm"
  bottom: "conv_blob6"
  top: "conv_blob6"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale6"
  type: "Scale"
  bottom: "conv_blob6"
  top: "conv_blob6"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "add2"
  type: "Eltwise"
  bottom: "conv_blob6"
  bottom: "relu_blob3"
  top: "add_blob2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "add_blob2"
  top: "relu_blob5"
}
#here
layer {
  name: "conv7"
  type: "BinaryConvolution"
  bottom: "relu_blob5"
  top: "conv_blob7"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm7"
  type: "BatchNorm"
  bottom: "conv_blob7"
  top: "conv_blob7"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale7"
  type: "Scale"
  bottom: "conv_blob7"
  top: "conv_blob7"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "conv_blob7"
  top: "relu_blob6"
}
layer {
  name: "conv8"
  type: "BinaryConvolution"
  bottom: "relu_blob6"
  top: "conv_blob8"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm8"
  type: "BatchNorm"
  bottom: "conv_blob8"
  top: "conv_blob8"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale8"
  type: "Scale"
  bottom: "conv_blob8"
  top: "conv_blob8"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv9"
  type: "BinaryConvolution"
  bottom: "relu_blob5"
  top: "conv_blob9"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm9"
  type: "BatchNorm"
  bottom: "conv_blob9"
  top: "conv_blob9"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale9"
  type: "Scale"
  bottom: "conv_blob9"
  top: "conv_blob9"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "add3"
  type: "Eltwise"
  bottom: "conv_blob8"
  bottom: "conv_blob9"
  top: "add_blob3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "add_blob3"
  top: "relu_blob7"
}
layer {
  name: "conv10"
  type: "BinaryConvolution"
  bottom: "relu_blob7"
  top: "conv_blob10"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm10"
  type: "BatchNorm"
  bottom: "conv_blob10"
  top: "conv_blob10"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale10"
  type: "Scale"
  bottom: "conv_blob10"
  top: "conv_blob10"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu8"
  type: "ReLU"
  bottom: "conv_blob10"
  top: "relu_blob8"
}
layer {
  name: "conv11"
  type: "BinaryConvolution"
  bottom: "relu_blob8"
  top: "conv_blob11"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm11"
  type: "BatchNorm"
  bottom: "conv_blob11"
  top: "conv_blob11"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale11"
  type: "Scale"
  bottom: "conv_blob11"
  top: "conv_blob11"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "add4"
  type: "Eltwise"
  bottom: "conv_blob11"
  bottom: "relu_blob7"
  top: "add_blob4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "relu9"
  type: "ReLU"
  bottom: "add_blob4"
  top: "relu_blob9"
}
layer {
  name: "conv12"
  type: "BinaryConvolution"
  bottom: "relu_blob9"
  top: "conv_blob12"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm12"
  type: "BatchNorm"
  bottom: "conv_blob12"
  top: "conv_blob12"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale12"
  type: "Scale"
  bottom: "conv_blob12"
  top: "conv_blob12"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu10"
  type: "ReLU"
  bottom: "conv_blob12"
  top: "relu_blob10"
}
layer {
  name: "conv13"
  type: "BinaryConvolution"
  bottom: "relu_blob10"
  top: "conv_blob13"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm13"
  type: "BatchNorm"
  bottom: "conv_blob13"
  top: "conv_blob13"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale13"
  type: "Scale"
  bottom: "conv_blob13"
  top: "conv_blob13"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv14"
  type: "BinaryConvolution"
  bottom: "relu_blob9"
  top: "conv_blob14"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm14"
  type: "BatchNorm"
  bottom: "conv_blob14"
  top: "conv_blob14"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale14"
  type: "Scale"
  bottom: "conv_blob14"
  top: "conv_blob14"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "add5"
  type: "Eltwise"
  bottom: "conv_blob13"
  bottom: "conv_blob14"
  top: "add_blob5"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "relu11"
  type: "ReLU"
  bottom: "add_blob5"
  top: "relu_blob11"
}
layer {
  name: "conv15"
  type: "BinaryConvolution"
  bottom: "relu_blob11"
  top: "conv_blob15"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm15"
  type: "BatchNorm"
  bottom: "conv_blob15"
  top: "conv_blob15"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale15"
  type: "Scale"
  bottom: "conv_blob15"
  top: "conv_blob15"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu12"
  type: "ReLU"
  bottom: "conv_blob15"
  top: "relu_blob12"
}
layer {
  name: "conv16"
  type: "BinaryConvolution"
  bottom: "relu_blob12"
  top: "conv_blob16"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm16"
  type: "BatchNorm"
  bottom: "conv_blob16"
  top: "conv_blob16"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale16"
  type: "Scale"
  bottom: "conv_blob16"
  top: "conv_blob16"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "add6"
  type: "Eltwise"
  bottom: "conv_blob16"
  bottom: "relu_blob11"
  top: "add_blob6"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "relu13"
  type: "ReLU"
  bottom: "add_blob6"
  top: "relu_blob13"
}
layer {
  name: "conv17"
  type: "BinaryConvolution"
  bottom: "relu_blob13"
  top: "conv_blob17"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm17"
  type: "BatchNorm"
  bottom: "conv_blob17"
  top: "conv_blob17"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale17"
  type: "Scale"
  bottom: "conv_blob17"
  top: "conv_blob17"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu14"
  type: "ReLU"
  bottom: "conv_blob17"
  top: "relu_blob14"
}
layer {
  name: "conv18"
  type: "BinaryConvolution"
  bottom: "relu_blob14"
  top: "conv_blob18"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm18"
  type: "BatchNorm"
  bottom: "conv_blob18"
  top: "conv_blob18"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale18"
  type: "Scale"
  bottom: "conv_blob18"
  top: "conv_blob18"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv19"
  type: "BinaryConvolution"
  bottom: "relu_blob13"
  top: "conv_blob19"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm19"
  type: "BatchNorm"
  bottom: "conv_blob19"
  top: "conv_blob19"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale19"
  type: "Scale"
  bottom: "conv_blob19"
  top: "conv_blob19"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "add7"
  type: "Eltwise"
  bottom: "conv_blob18"
  bottom: "conv_blob19"
  top: "add_blob7"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "relu15"
  type: "ReLU"
  bottom: "add_blob7"
  top: "relu_blob15"
}
layer {
  name: "conv20"
  type: "BinaryConvolution"
  bottom: "relu_blob15"
  top: "conv_blob20"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm20"
  type: "BatchNorm"
  bottom: "conv_blob20"
  top: "conv_blob20"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale20"
  type: "Scale"
  bottom: "conv_blob20"
  top: "conv_blob20"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu16"
  type: "ReLU"
  bottom: "conv_blob20"
  top: "relu_blob16"
}
layer {
  name: "conv21"
  type: "BinaryConvolution"
  bottom: "relu_blob16"
  top: "conv_blob21"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "batch_norm21"
  type: "BatchNorm"
  bottom: "conv_blob21"
  top: "conv_blob21"
  batch_norm_param {
    eps: 9.9999997e-06
  }
}
layer {
  name: "bn_scale21"
  type: "Scale"
  bottom: "conv_blob21"
  top: "conv_blob21"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "add8"
  type: "Eltwise"
  bottom: "conv_blob21"
  bottom: "relu_blob15"
  top: "add_blob8"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "relu17"
  type: "ReLU"
  bottom: "add_blob8"
  top: "relu_blob17"
}
layer {
  name: "ave_pool1"
  type: "Pooling"
  bottom: "relu_blob17"
  top: "ave_pool_blob1"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "view1"
  type: "Reshape"
  bottom: "ave_pool_blob1"
  top: "view_blob1"
  reshape_param {
    shape {
      dim: 0
      dim: -1
    }
  }
}
layer {
  name: "fc"
  type: "BinaryInnerProduct"
  bottom: "view_blob1"
  top: "pred"
  inner_product_param {
    num_output: 2
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
    name: "loss"
    type: "FocalLoss"
    bottom: "pred"
    bottom: "label"
    top: "loss"
#    include {
#        phase: TRAIN
#    }
    #propagate_down: 1
    #propagate_down: 0
    loss_weight: 1
    loss_param {
        ignore_label: -1
        normalize: true
    }
    focal_loss_param {
        alpha: 0.25
        gamma: 2
    }
}

#layer {
#    bottom: "pred"
#    bottom: "label"
#    name: "loss"
#    type: "SoftmaxWithLoss"
#    top: "loss"
#}

layer {
    bottom: "pred"
    bottom: "label"
    top: "accuracy"
    name: "accuracy"
    type: "Accuracy"
}
